export const long = {
  "year": {
    "previous": "в прошлом году",
    "next": "в следующем году",
    "future": {
      "one": "через {0} год",
      "few": "через {0} года",
      "many": "через {0} лет",
      "other": "через {0} года"
    },
    "past": {
      "one": "{0} год назад",
      "few": "{0} года назад",
      "many": "{0} лет назад",
      "other": "{0} года назад"
    }
  },
  "month": {
    "previous": "в прошлом месяце",
    "next": "в следующем месяце",
    "future": {
      "one": "через {0} месяц",
      "few": "через {0} месяца",
      "many": "через {0} месяцев",
      "other": "через {0} месяца"
    },
    "past": {
      "one": "{0} месяц назад",
      "few": "{0} месяца назад",
      "many": "{0} месяцев назад",
      "other": "{0} месяца назад"
    }
  },
  "week": {
    "previous": "на прошлой неделе",
    "next": "на следующей неделе",
    "future": {
      "one": "через {0} неделю",
      "few": "через {0} недели",
      "many": "через {0} недель",
      "other": "через {0} недели"
    },
    "past": {
      "one": "{0} неделю назад",
      "few": "{0} недели назад",
      "many": "{0} недель назад",
      "other": "{0} недели назад"
    }
  },
  "day": {
    "previous": "вчера",
    "next": "завтра",
    "future": {
      "one": "через {0} день",
      "few": "через {0} дня",
      "many": "через {0} дней",
      "other": "через {0} дней"
    },
    "past": {
      "one": "{0} день назад",
      "few": "{0} дня назад",
      "many": "{0} дней назад",
      "other": "{0} дня назад"
    }
  },
  "hour": {
    "future": {
      "one": "через {0} час",
      "few": "через {0} часа",
      "many": "через {0} часов",
      "other": "через {0} часа"
    },
    "past": {
      "one": "{0} час назад",
      "few": "{0} часа назад",
      "many": "{0} часов назад",
      "other": "{0} часа назад"
    }
  },
  "minute": {
    "future": {
      "one": "через {0} минуту",
      "few": "через {0} минуты",
      "many": "через {0} минут",
      "other": "через {0} минуты"
    },
    "past": {
      "one": "{0} минуту назад",
      "few": "{0} минуты назад",
      "many": "{0} минут назад",
      "other": "{0} минуты назад"
    }
  },
  "second": {
    "future": {
      "one": "через {0} секунду",
      "few": "через {0} секунды",
      "many": "через {0} секунд",
      "other": "через {0} секунды"
    },
    "past": {
      "one": "{0} секунду назад",
      "few": "{0} секунды назад",
      "many": "{0} секунд назад",
      "other": "{0} секунды назад"
    }
  }
}

export const short = {
  "year": {
    "previous": "в прошлом году",
    "next": "в следующем году",
    "future": {
      "one": "через {0} г.",
      "few": "через {0} г.",
      "many": "через {0} л.",
      "other": "через {0} г."
    },
    "past": {
      "one": "{0} г. назад",
      "few": "{0} г. назад",
      "many": "{0} л. назад",
      "other": "{0} г. назад"
    }
  },
  "month": {
    "previous": "в прошлом месяце",
    "next": "в следующем месяце",
    "future": {
      "one": "через {0} мес.",
      "few": "через {0} мес.",
      "many": "через {0} мес.",
      "other": "через {0} мес."
    },
    "past": {
      "one": "{0} мес. назад",
      "few": "{0} мес. назад",
      "many": "{0} мес. назад",
      "other": "{0} мес. назад"
    }
  },
  "week": {
    "previous": "на прошлой неделе",
    "next": "на следующей неделе",
    "future": {
      "one": "через {0} нед.",
      "few": "через {0} нед.",
      "many": "через {0} нед.",
      "other": "через {0} нед."
    },
    "past": {
      "one": "{0} нед. назад",
      "few": "{0} нед. назад",
      "many": "{0} нед. назад",
      "other": "{0} нед. назад"
    }
  },
  "day": {
    "previous": "вчера",
    "next": "завтра",
    "future": {
      "one": "через {0} д.",
      "few": "через {0} д.",
      "many": "через {0} д.",
      "other": "через {0} д."
    },
    "past": {
      "one": "{0} д. назад",
      "few": "{0} д. назад",
      "many": "{0} д. назад",
      "other": "{0} д. назад"
    }
  },
  "hour": {
    "future": {
      "one": "через {0} ч.",
      "few": "через {0} ч.",
      "many": "через {0} ч.",
      "other": "через {0} ч."
    },
    "past": {
      "one": "{0} ч. назад",
      "few": "{0} ч. назад",
      "many": "{0} ч. назад",
      "other": "{0} ч. назад"
    }
  },
  "minute": {
    "future": {
      "one": "через {0} мин.",
      "few": "через {0} мин.",
      "many": "через {0} мин.",
      "other": "через {0} мин."
    },
    "past": {
      "one": "{0} мин. назад",
      "few": "{0} мин. назад",
      "many": "{0} мин. назад",
      "other": "{0} мин. назад"
    }
  },
  "second": {
    "future": {
      "one": "через {0} сек.",
      "few": "через {0} сек.",
      "many": "через {0} сек.",
      "other": "через {0} сек."
    },
    "past": {
      "one": "{0} сек. назад",
      "few": "{0} сек. назад",
      "many": "{0} сек. назад",
      "other": "{0} сек. назад"
    }
  }
}

export default long