var long = {
  "year": {
    "previous": "год назад",
    "next": "через год",
    "future": {
      "one": "через {0} год",
      "few": "через {0} года",
      "many": "через {0} лет",
      "other": "через {0} года"
    },
    "past": {
      "one": "{0} год назад",
      "few": "{0} года назад",
      "many": "{0} лет назад",
      "other": "{0} года назад"
    }
  },
  "half-year": {
    "future": {
      "other": "через полгода"
    },
    "past": {
      "other": "полгода назад"
    }
  },
  "month": {
    "previous": "месяц назад",
    "next": "через месяц",
    "future": {
      "one": "через {0} месяц",
      "few": "через {0} месяца",
      "many": "через {0} месяцев",
      "other": "через {0} месяца"
    },
    "past": {
      "one": "{0} месяц назад",
      "few": "{0} месяца назад",
      "many": "{0} месяцев назад",
      "other": "{0} месяца назад"
    }
  },
  "week": {
    "previous": "неделю назад",
    "next": "через неделю",
    "future": {
      "one": "через {0} неделю",
      "few": "через {0} недели",
      "many": "через {0} недель",
      "other": "через {0} недели"
    },
    "past": {
      "one": "{0} неделю назад",
      "few": "{0} недели назад",
      "many": "{0} недель назад",
      "other": "{0} недели назад"
    }
  },
  "day": {
    "previous": "днём ранее",
    "next": "через день",
    "future": {
      "one": "через {0} день",
      "few": "через {0} дня",
      "many": "через {0} дней",
      "other": "через {0} дней"
    },
    "past": {
      "one": "{0} день назад",
      "few": "{0} дня назад",
      "many": "{0} дней назад",
      "other": "{0} дня назад"
    }
  },
  "hour": {
    "previous": "час назад",
    "next": "через час",
    "future": {
      "one": "через {0} час",
      "few": "через {0} часа",
      "many": "через {0} часов",
      "other": "через {0} часа"
    },
    "past": {
      "one": "{0} час назад",
      "few": "{0} часа назад",
      "many": "{0} часов назад",
      "other": "{0} часа назад"
    }
  },
  "half-hour": {
    "future": {
      "other": "через полчаса"
    },
    "past": {
      "other": "полчаса назад"
    }
  },
  "minute": {
    "previous": "минуту назад",
    "next": "через минуту",
    "future": {
      "one": "через {0} минуту",
      "few": "через {0} минуты",
      "many": "через {0} минут",
      "other": "через {0} минуты"
    },
    "past": {
      "one": "{0} минуту назад",
      "few": "{0} минуты назад",
      "many": "{0} минут назад",
      "other": "{0} минуты назад"
    }
  },
  "second": {
    "previous": "секунду назад",
    "next": "через секунду",
    "current": "сейчас",
    "future": {
      "one": "через {0} секунду",
      "few": "через {0} секунды",
      "many": "через {0} секунд",
      "other": "через {0} секунды"
    },
    "past": {
      "one": "{0} секунду назад",
      "few": "{0} секунды назад",
      "many": "{0} секунд назад",
      "other": "{0} секунды назад"
    }
  },
  "just-now": {
    "past": {
      "other": "только что"
    },
    "future": {
      "other": "сейчас"
    }
  }
}

var long_concise = {
  "year": {
    "previous": "год",
    "next": "год",
    "future": {
      "one": "{0} год",
      "few": "{0} года",
      "many": "{0} лет",
      "other": "{0} года"
    },
    "past": {
      "one": "{0} год",
      "few": "{0} года",
      "many": "{0} лет",
      "other": "{0} года"
    }
  },
  "half-year": {
    "future": {
      "other": "полгода"
    },
    "past": {
      "other": "полгода"
    }
  },
  "month": {
    "previous": "месяц",
    "next": "месяц",
    "future": {
      "one": "{0} месяц",
      "few": "{0} месяца",
      "many": "{0} месяцев",
      "other": "{0} месяца"
    },
    "past": {
      "one": "{0} месяц",
      "few": "{0} месяца",
      "many": "{0} месяцев",
      "other": "{0} месяца"
    }
  },
  "week": {
    "previous": "неделю",
    "next": "неделю",
    "future": {
      "one": "{0} неделю",
      "few": "{0} недели",
      "many": "{0} недель",
      "other": "{0} недели"
    },
    "past": {
      "one": "{0} неделю",
      "few": "{0} недели",
      "many": "{0} недель",
      "other": "{0} недели"
    }
  },
  "day": {
    "future": {
      "one": "{0} день",
      "few": "{0} дня",
      "many": "{0} дней",
      "other": "{0} дней"
    },
    "past": {
      "one": "{0} день",
      "few": "{0} дня",
      "many": "{0} дней",
      "other": "{0} дня"
    }
  },
  "hour": {
    "previous": "час",
    "next": "час",
    "future": {
      "one": "{0} час",
      "few": "{0} часа",
      "many": "{0} часов",
      "other": "{0} часа"
    },
    "past": {
      "one": "{0} час",
      "few": "{0} часа",
      "many": "{0} часов",
      "other": "{0} часа"
    }
  },
  "half-hour": {
    "future": {
      "other": "полчаса"
    },
    "past": {
      "other": "полчаса"
    }
  },
  "minute": {
    "future": {
      "one": "{0} минута",
      "few": "{0} минуты",
      "many": "{0} минут",
      "other": "{0} минуты"
    },
    "past": {
      "one": "{0} минута",
      "few": "{0} минуты",
      "many": "{0} минут",
      "other": "{0} минуты"
    }
  },
  "second": {
    "current": "сейчас",
    "future": {
      "one": "{0} секунда",
      "few": "{0} секунды",
      "many": "{0} секунд",
      "other": "{0} секунды"
    },
    "past": {
      "one": "{0} секунда",
      "few": "{0} секунды",
      "many": "{0} секунд",
      "other": "{0} секунды"
    }
  },
  "just-now": {
    "past": {
      "other": "только что"
    },
    "future": {
      "other": "сейчас"
    }
  }
}

var short = {
  "year": {
    "future": {
      "one": "через {0} г.",
      "few": "через {0} г.",
      "many": "через {0} л.",
      "other": "через {0} г."
    },
    "past": {
      "one": "{0} г. назад",
      "few": "{0} г. назад",
      "many": "{0} л. назад",
      "other": "{0} г. назад"
    }
  },
  "month": {
    "future": {
      "one": "через {0} мес.",
      "few": "через {0} мес.",
      "many": "через {0} мес.",
      "other": "через {0} мес."
    },
    "past": {
      "one": "{0} мес. назад",
      "few": "{0} мес. назад",
      "many": "{0} мес. назад",
      "other": "{0} мес. назад"
    }
  },
  "week": {
    "future": {
      "one": "через {0} нед.",
      "few": "через {0} нед.",
      "many": "через {0} нед.",
      "other": "через {0} нед."
    },
    "past": {
      "one": "{0} нед. назад",
      "few": "{0} нед. назад",
      "many": "{0} нед. назад",
      "other": "{0} нед. назад"
    }
  },
  "day": {
    "previous": "днём ранее",
    "next": "через день",
    "future": {
      "one": "через {0} д.",
      "few": "через {0} д.",
      "many": "через {0} д.",
      "other": "через {0} д."
    },
    "past": {
      "one": "{0} д. назад",
      "few": "{0} д. назад",
      "many": "{0} д. назад",
      "other": "{0} д. назад"
    }
  },
  "hour": {
    "future": {
      "one": "через {0} ч.",
      "few": "через {0} ч.",
      "many": "через {0} ч.",
      "other": "через {0} ч."
    },
    "past": {
      "one": "{0} ч. назад",
      "few": "{0} ч. назад",
      "many": "{0} ч. назад",
      "other": "{0} ч. назад"
    }
  },
  "minute": {
    "future": {
      "one": "через {0} мин.",
      "few": "через {0} мин.",
      "many": "через {0} мин.",
      "other": "через {0} мин."
    },
    "past": {
      "one": "{0} мин. назад",
      "few": "{0} мин. назад",
      "many": "{0} мин. назад",
      "other": "{0} мин. назад"
    }
  },
  "second": {
    "current": "сейчас",
    "future": {
      "one": "через {0} сек.",
      "few": "через {0} сек.",
      "many": "через {0} сек.",
      "other": "через {0} сек."
    },
    "past": {
      "one": "{0} сек. назад",
      "few": "{0} сек. назад",
      "many": "{0} сек. назад",
      "other": "{0} сек. назад"
    }
  },
  "just-now": {
    "past": {
      "other": "только что"
    },
    "future": {
      "other": "сейчас"
    }
  }
}

var short_concise = {
  "year": {
    "future": {
      "one": "{0} г.",
      "few": "{0} г.",
      "many": "{0} л.",
      "other": "{0} г."
    },
    "past": {
      "one": "{0} г.",
      "few": "{0} г.",
      "many": "{0} л.",
      "other": "{0} г."
    }
  },
  "month": {
    "future": {
      "one": "{0} мес.",
      "few": "{0} мес.",
      "many": "{0} мес.",
      "other": "{0} мес."
    },
    "past": {
      "one": "{0} мес.",
      "few": "{0} мес.",
      "many": "{0} мес.",
      "other": "{0} мес."
    }
  },
  "week": {
    "future": {
      "one": "{0} нед.",
      "few": "{0} нед.",
      "many": "{0} нед.",
      "other": "{0} нед."
    },
    "past": {
      "one": "{0} нед.",
      "few": "{0} нед.",
      "many": "{0} нед.",
      "other": "{0} нед."
    }
  },
  "day": {
    "future": {
      "one": "{0} д.",
      "few": "{0} д.",
      "many": "{0} д.",
      "other": "{0} д."
    },
    "past": {
      "one": "{0} д.",
      "few": "{0} д.",
      "many": "{0} д.",
      "other": "{0} д."
    }
  },
  "hour": {
    "future": {
      "one": "{0} ч.",
      "few": "{0} ч.",
      "many": "{0} ч.",
      "other": "{0} ч."
    },
    "past": {
      "one": "{0} ч.",
      "few": "{0} ч.",
      "many": "{0} ч.",
      "other": "{0} ч."
    }
  },
  "minute": {
    "future": {
      "one": "{0} мин.",
      "few": "{0} мин.",
      "many": "{0} мин.",
      "other": "{0} мин."
    },
    "past": {
      "one": "{0} мин.",
      "few": "{0} мин.",
      "many": "{0} мин.",
      "other": "{0} мин."
    }
  },
  "second": {
    "current": "сейчас",
    "future": {
      "one": "{0} сек.",
      "few": "{0} сек.",
      "many": "{0} сек.",
      "other": "{0} сек."
    },
    "past": {
      "one": "{0} сек.",
      "few": "{0} сек.",
      "many": "{0} сек.",
      "other": "{0} сек."
    }
  },
  "just-now": {
    "past": {
      "other": "только что"
    },
    "future": {
      "other": "сейчас"
    }
  }
}

var tiny = {
  "year": {
    "future": {
      "other": "{0}г"
    },
    "past": {
      "other": "{0}г"
    }
  },
  "month": {
    "future": {
      "other": "{0}мес"
    },
    "past": {
      "other": "{0}мес"
    }
  },
  "week": {
    "future": {
      "other": "{0}нед"
    },
    "past": {
      "other": "{0}нед"
    }
  },
  "day": {
    "future": {
      "other": "{0}д"
    },
    "past": {
      "other": "{0}д"
    }
  },
  "hour": {
    "future": {
      "other": "{0}ч"
    },
    "past": {
      "other": "{0}ч"
    }
  },
  "minute": {
    "future": {
      "other": "{0}м"
    },
    "past": {
      "other": "{0}м"
    }
  },
  "second": {
    "current": "now",
    "past": {
      "other": "{0}с"
    },
    "future": {
      "other": "{0}с"
    }
  },
  "just-now": {
    "past": {
      "other": ""
    },
    "future": {
      "other": ""
    }
  }
}

module.exports =
{
  locale        : 'ru',
  default       : long,

  tiny          : tiny,
  short         : short,
  short_concise : short_concise,
  long          : long,
  long_concise  : long_concise
}